{
  "url": "https://cointelegraph.com/learn/articles/scott-bessent",
  "title": "Who is Scott Bessent? Meet the new face of US economic policy",
  "content": "Once a Wall Street player quietly working behind the scenes, Treasury Secretary Scott Bessent has taken center stage as the architect of America’s economic future under President Donald Trump’s second term.\n\nWith acumen in financial matters and a capacity for thinking outside the box, Bessent combines financial expertise with political pragmatism to craft policies that challenge traditional economic thinking.\n\nFrom deregulating banking to reshaping global trade, Bessent’s impact goes beyond numbers and charts at the Treasury.\n\nWho is this man on the steering wheel of the American economic system? Here is a deep dive to help you find out.\n\nBessent was born in Conway, South Carolina on Aug. 21, 1962. From an early age, he showed strong academic potential and leadership skills that would later define his career. He pursued higher education at Yale University, graduating in 1984 with a Bachelor of Arts in political science.\n\nDuring his time at Yale, Bessent was involved in campus life. He served as the editor of The Yale Daily News, showcasing an interest in current affairs and communication. His leadership qualities also earned him the role of president of the prestigious Wolf’s Head Society, one of Yale’s senior secret societies.\n\nBessent also acted as class treasurer, reflecting his early aptitude for financial and organizational responsibilities. These formative experiences helped shape Bessent’s worldview and laid a solid foundation for his future in finance, investment and ultimately, US economic policy leadership.\n\nHere is information about Bessent’s personal life in a nutshell:\n\nBessent’s personal life reflects his commitment to family, community and cultural values. He resides in Charleston, South Carolina, with his husband, John Freeman, and their two children. Known for his appreciation of history and architecture, Bessent restored Charleston’s iconic Pink Palace, a Gilded Age mansion on East Battery Street.\n\nBeyond his professional and personal pursuits, Bessent has been an active philanthropist. He has supported his alma mater, Yale University, through scholarships and educational programs. He is also involved with the Prince’s Trust, a UK-based charity that helps disadvantaged youth build a future, and the Harlem Children’s Zone, a US nonprofit focused on education and community support in underserved neighborhoods.\n\nBessent’s philanthropy extends to the arts as well. He has served on advisory boards for institutions including the New Museum of Contemporary Art and is known for contributing to cultural and civic causes. His personal life and commitments reflect empowerment, preservation and education, values that align with his public service vision.\n\nBessent’s financial journey is a masterclass in global macro investing. It started with a formative internship under Jim Rogers, the iconic investor who co-created the Quantum Fund with George Soros. The early exposure to high-stakes finance laid the groundwork for Bessent’s future success. His stints at firms like Brown Brothers Harriman and Kynikos Associates honed his analytical and trading skills.\n\nIn 1991, Bessent joined Soros Fund Management, a move that would launch him into the big leagues. A year later, he became one of the key players in the famous Black Wednesday trade (Sept. 16, 1992).\n\nOn this day, George Soros and his team, including Scott Bessent, famously shorted the British pound, believing it was overvalued within the European Exchange Rate Mechanism (ERM), a system meant to keep European currencies stable ahead of forming the euro. The UK agreed to keep the pound within a narrow trading band against Germany’s Deutsche Mark. However, the UK economy was too weak to maintain the high interest rates required to support the pound.\n\nSoros’s Quantum Fund sold billions in pounds, betting the UK would be forced to devalue. Despite the Bank of England’s efforts to defend the currency through rate hikes and reserve spending, the UK exited the ERM, causing the pound to crash. Soros profited over $1 billion, earning a reputation as “The man who broke the Bank of England.”\n\nAfter nearly 20 years with Soros, Bessent founded Key Square Group with Soros’s support in 2015. The global macro fund devised intricate strategies across currencies, interest rates and commodities, peaking at over $8 billion in assets. In 2020, Bessent returned capital to external investors to focus on family office investing.\n\nThrough the years, Bessent has cultivated a reputation for geopolitical foresight, efficient risk management and an ability to spot macroeconomic trends. Now, as Treasury secretary, Bessent is writing a new chapter in his career.\n\nDid you know? Scott Bessent once managed over $26 billion in assets as the chief investment officer for George Soros’s family office. Known for his market instincts, Bessent left Soros Fund Management in 2015 to launch his hedge fund, Key Square Group, with $2 billion in seed capital.\n\nBessent’s journey from the financial world to the center of US politics wasn’t a predictable climb. Rather, it was a bold leap that took many by surprise. For years, Bessent backed Democrats and progressive causes, throwing his support behind campaigns and groups that matched his centrist, globalist outlook regarding economic policies.\n\nBut around 2023, a shift happened. Frustrated by what he called economic mismanagement and stifling regulations, Bessent adopted a more pragmatic, growth-first approach to policy. That move led him to an unlikely alliance with Trump.\n\nDuring Trump’s 2024 campaign, Bessent emerged as a key player, shaping a “3/3/3” economic plan to cut the deficit, boost oil production and hit 3% GDP growth. His financial expertise and real-world market perspective made him an asset on the campaign trail. He became a clear choice for a top role when Trump emerged victorious in the presidential election and was inaugurated as the 47th president.\n\nIn January 2025, Bessent was sworn in as the 79th Treasury secretary, stepping into the driver’s seat of America’s economy. His appointment broke barriers: As an openly LGBT individual, he became the highest-ranking openly gay official in US government history, a standout in an otherwise conservative administration.\n\nIn April 2025, a disagreement between Bessent and Elon Musk took place in the West Wing of the White House in the presence of President Trump and visiting officials. They argued about who should run the Internal Revenue Service (IRS). Musk's choice was Gary Shapley, and Bessent's choice was Michael Faulkender. Trump later appointed Faulkender as the head of the IRS.\n\nBessent mixes financial instincts with political clout. Whether he is striking trade deals or crafting banking rules, his influence blends Trump’s America-first agenda with a realist approach.\n\nDid you know? Bessent is the first publicly gay Treasury secretary and the first publicly LGBTQ Senate-confirmed Cabinet member in a Republican administration.\n\n​Bessent has been an advocate of integrating cryptocurrency into the nation’s economic framework. He envisions the US as a global leader in digital assets, emphasizing the need to bring cryptocurrency activities onshore under clear regulatory oversight. ​His approach balances innovation with regulation, aiming to strengthen the US financial system and keep the dollar dominant in the digital era.\n\nTrump, flanked by Bessent and crypto czar David Sacks, announced the Strategic Bitcoin Reserve project. Under Trump’s executive order, the US would consolidate Bitcoin  BTC $94,023 Bitcoin  Change (24h) 0.06% Market Cap  $1.86T  Volume (24h)  $25.8B  View More  seized through criminal and civil forfeitures and hold it as a reserve asset. The Bitcoin reserve would be used as a hedge against financial instability. As of March 8, 2025, the US government held about $17 billion worth of Bitcoin, seized or acquired through various lawsuits and legal proceedings.\n\nBessent also supports stablecoins backed by US Treasury bills and cash, seeing them as tools to promote the dollar’s dominance in the world’s economic system. He has publicly supported the GENIUS Act and emphasizes the importance of clarity and regulation around stablecoins. He favors a comprehensive stablecoin regulatory framework that aligns with the administration’s agenda of fostering innovation in the financial sector.\n\nTo advance his crypto vision, Bessent appointed Tyler Williams, a former Galaxy Digital lawyer, as a senior adviser on blockchain and digital assets.\n\nBessent has also called for a thorough review of existing regulatory frameworks around digital assets. He has said current rules stifle innovation, especially for blockchain startups and new payment systems. He advocates a regulatory environment that promotes responsible innovation, financial inclusion and technological leadership.\n\nIn international forums, Bessent looks to align digital asset regulations across key markets to avoid fragmentation. Through these policies, he aims to see the US remain a hub for crypto innovation.\n\nDid you know? Known for his sharp fashion sense, Bessent’s public appearances often feature tailored suits and bold colors — a subtle nod to his flair for both finance and style.\n\nAs the Treasury secretary in Trump’s second term, Bessent introduced a comprehensive economic blueprint dubbed the “3/3/3” plan. This strategy focuses on reducing the federal deficit to 3% of GDP, fuelling 3% annual economic growth and increasing domestic oil production by 3 million barrels per day. It is a high-stakes gamble that promises to reshape America’s financial landscape.\n\nTo bring down the deficit, Bessent proposes significant steps, including cuts to social safety nets like Medicaid and nutrition support, while hiking tariffs on imports. These moves, however, have sparked concern among analysts who warn that low- and middle-income families would be hurt, facing squeezed budgets and reduced living standards.\n\nOn the global stage, Bessent is playing a strategic game with trade policy, particularly with China. He sees tariffs as dual-purpose tools, shields for American industries and bargaining chips in diplomatic chess matches. He has said a trade war with China is unsustainable and advocates for mutual reductions to pave the way for more balanced trade relations.​\n\nIn the financial arena, Bessent advocates lowering bank leverage rules to encourage lending. His plan includes exempting short-term Treasury investments from certain capital requirements, which would ease government borrowing costs. Bessent has downplayed concerns that reciprocal tariffs will lead to higher inflation.\n\nBessent’s economic vision emphasizes fiscal discipline, strategic trade policies and financial sector reforms to stimulate growth. The potential social implications and financial risks of these initiatives have sparked considerable debate among policymakers and economists.\n\nAs Treasury secretary, Bessent drives America’s economic plans domestically and abroad.\n\nAt home, Bessent plans to spur economic growth by cutting red tape. He is working with federal banking agencies to ease oversight on community banks, as he says strict regulations have made it harder for the banks to lend money. By pushing for simpler, practical banking regulations, Bessent wants to make it easier for lenders to fuel the US economy.\n\nOn the global stage, Bessent is shaking things up. He has called out the International Monetary Fund (IMF) and World Bank, arguing they have lost focus by tackling social issues instead of sticking to financial stability and economic reforms. Criticisms notwithstanding, Bessent has reaffirmed the US’s commitment to these institutions, advocating for reforms rather than withdrawal.\n\nHere’s Bessent’s timeline as a finance professional and a Cabinet member:\n\nBessent is also making waves with his support for Argentina’s economic turnaround. He backed a $20 billion IMF loan to the country and hinted that the US could provide extra help if Argentina faces unexpected challenges. He sees Argentina’s market-friendly approach as an example for other countries and a way to counter China’s growing regional influence.\n\nPerhaps his boldest move is the “Mar-a-Lago Accord,” a plan to reshape global trade and financial matters. This strategy aims to shrink the US trade deficit, bring back American manufacturing and strengthen economic ties by using tariffs, currency policies and trade deals linked to national security.\n\nThrough these efforts, Bessent is steering US economic policy toward less regulation of markets. His economic vision is clear: Put America’s economy first.",
  "author": "",
  "published_date": "March 8, 2025",
  "source_domain": "cointelegraph.com",
  "is_cached": false,
  "links": [
    "https://twitter.com/cointelegraph",
    "https://telegram.me/cointelegraph",
    "https://www.facebook.com/cointelegraph",
    "https://www.youtube.com/channel/UCRqBu-grVX1p97WaX4d-OuQ",
    "https://cointelegraph.com/learn",
    "https://servedbyadbutler.com/redirect.spark?MID=169476&plid=2941640&setID=591936&channelID=0&CID=1145879&banID=523036442&PID=0&textadID=0&tc=1&type=tclick&mt=1&hc=51ee5339957ae8b85a8859e3d5caada8af0c4f57&location=",
    "https://cointelegraph.com/explained/what-is-trump-donald-trumps-billion-dollar-memecoin",
    "https://cointelegraph.com/learn/articles/elon-musks-net-worth-breakdown",
    "https://cointelegraph.com/learn/articles/president-donald-trumps-cabinet",
    "https://cointelegraph.com/learn/articles/what-is-a-cryptocurrency-a-beginners-guide-to-digital-money",
    "https://cointelegraph.com/explained/trumps-strategic-bitcoin-reserve-and-digital-asset-stockpile-explained",
    "https://cointelegraph.com/bitcoin-price",
    "https://cointelegraph.com/learn/articles/stablecoins-101-what-are-crypto-stablecoins-and-how-do-they-work",
    "https://cointelegraph.com/learn/articles/genius-act-how-it-could-reshape-us-stablecoin-regulation",
    "https://cointelegraph.com/learn/articles/us-crypto-bills-compared-stable-act-vs-genius-act",
    "https://cointelegraph.com/explained/tariffs-explained-how-they-work-and-why-they-matter",
    "https://cointelegraph.com/explained/how-trade-wars-impact-stocks-and-crypto",
    "https://servedbyadbutler.com/redirect.spark?MID=169476&plid=2923715&setID=868627&channelID=0&CID=0&banID=523003855&PID=0&textadID=0&tc=1&rnd=8576718733&scheduleID=2866346&adSize=300x250&mt=1745848695194944&spr=1&referrer=https%3A%2F%2Fcointelegraph.com%2F&hc=f7ee92437218371de445bcb220814c175a7e7bf8&location=",
    "https://servedbyadbutler.com/redirect.spark?MID=169476&plid=2857335&setID=868623&channelID=0&CID=0&banID=522887173&PID=0&textadID=0&tc=1&rnd=5674759056&scheduleID=2796032&adSize=0x0&mt=1745848695193647&spr=1&referrer=https%3A%2F%2Fcointelegraph.com%2F&hc=12cbf701e1297cd2a8fe4b10bbcac94cff2d5e67&location=",
    "https://servedbyadbutler.com/redirect.spark?MID=169476&plid=2857340&setID=868624&channelID=0&CID=0&banID=522887174&PID=0&textadID=0&tc=1&rnd=5512297564&scheduleID=2796037&adSize=300x250&mt=1745848695195189&spr=1&referrer=https%3A%2F%2Fcointelegraph.com%2F&hc=099af3d6463179702c12bd401d1511f082505fdc&location="
  ]
}