{
  "username": "APompliano",
  "name": "",
  "tweets": [
    {
      "text": "True wealth looks different than you think.",
      "created_at": "2025-03-30T00:26:46.000Z",
      "url": "https://x.com/APompliano/status/1906141014026297522",
      "stats": {
        "likes": 452,
        "retweets": 717,
        "replies": 452
      },
      "is_retweet": true,
      "original_author": null,
      "is_truncated": false,
      "links": {
        "external_urls": [],
        "mentions": [],
        "hashtags": [],
        "media_urls": [
          "https://x.com/APompliano/status/1906141014026297522/photo/1"
        ]
      }
    },
    {
      "text": "We need 1-2 interest rate cuts and a few trade deals announced for the Wall Street folks to get amnesia and forget they were in a full panic just a few weeks ago. Stonks only go up, baby! DOPAMINE: THE INVISIBLE ENEMY OF YOUR FREEDOM\n(1) Dopamine.\nInvisible, yet omnipresent.\nIt controls our lives, our choices, our failures.\nUnderstanding dopamine might be the first true freedom. Printers go brrrr, markets go - that's the vibes we need. Rate cuts are coming!! It’s coming Interest rates should drop, calm market chaos yep kinda already happening. the end of the markets doom squad already has pie on their face. In financial markets, narrative decay half-life is faster than economic cycles. Cuts and deals are just the memory wipe button. wen rate cuts Inflation is falling, we may see cuts soon Markets recovered quickly It’s been weeks. Not a single trade deal. Not one. It's wild how quickly sentiment can flip from doom to euphoria based on just a few Fed decisions and headlines. Bullshit this fkr is toast.. reps on the line.. i think we are close Exactly, but it looks like we'll have to wait for the June Fed meeting for next rate cut. Nailed it!! Wall Street needs rate cuts to forget panic? Please. A green candle on Bitcoin does the same for the degens. Market memory is measured in minutes, apparently. Just hold the index, ignore the noise. That would be glorious Can you please share the rational why interest rates would not cause further inflation? Knowing tariffs are not done and we don’t have enough data of a probable impact.",
      "created_at": "2025-04-28T13:26:36.000Z",
      "url": "https://x.com/APompliano/status/1916846513096888589",
      "stats": {
        "likes": 398,
        "retweets": 29,
        "replies": 76
      },
      "is_retweet": false,
      "original_author": null,
      "is_truncated": false,
      "links": {
        "external_urls": [],
        "mentions": [],
        "hashtags": [],
        "media_urls": []
      }
    },
    {
      "text": "There are two types of people in the world — those who are cheering for others to succeed and those who are not.\n\nWe need as many people in the first group as we can get. Keep cheering and working on till your turn Certification Trend Micro MSP édition 2025\n\nGérez efficacement le cycle de vie complet de la sécurité de vos clients :\n\nAvant, pendant et après l'intrusion cheer them on and fund them if possible Abundance mindset > scarcity mindset. Always. success isn't zero sum. more wins, more possibilities for everyone I'm cheering for everyone who is building something revolutionary. Unfortunately, many people develop envy. Some people see others winning and think, \"me too.\"\n\nOthers see it and think, \"why not me?\"\n\nGuess which group builds empires. We need to become the first kind. Surround yourself with people who genuinely want to see you win. Imagine what we could build if so much of the world wasn’t fixated on just tearing things (and people) down. A world of builders needs builders of builders. Just like there are two types of assets — Bitcoin, which empowers and grows with the people, and everything else that doesn’t. We need more Bitcoin believers, just like we need more people cheering for others to succeed. Agree yeah life’s way better when we’re rooting for each other :) Those who cheer for others reveal a heart abundant enough to see life as collaboration, not competition. \n\nIn a world starved for genuine encouragement, be the rare soul who multiplies light instead of hoarding it. Totally",
      "created_at": "2025-04-28T12:52:28.000Z",
      "url": "https://x.com/APompliano/status/1916837921333694812",
      "stats": {
        "likes": 388,
        "retweets": 28,
        "replies": 69
      },
      "is_retweet": false,
      "original_author": null,
      "is_truncated": false,
      "links": {
        "external_urls": [],
        "mentions": [],
        "hashtags": [],
        "media_urls": []
      }
    },
    {
      "text": "“We are not going to be taken advantage of anymore.” - \n@SecScottBessent\n ",
      "created_at": "2025-04-28T12:06:05.000Z",
      "url": "https://x.com/APompliano/status/1916826248304619684",
      "stats": {
        "likes": 431,
        "retweets": 23,
        "replies": 47
      },
      "is_retweet": true,
      "original_author": "SecScottBessent",
      "is_truncated": false,
      "links": {
        "external_urls": [],
        "mentions": [
          "SecScottBessent"
        ],
        "hashtags": [],
        "media_urls": []
      }
    },
    {
      "text": "Good morning. Today is going to be a great day. Let’s get after it relentlessly.",
      "created_at": "2025-04-28T09:35:54.000Z",
      "url": "https://x.com/APompliano/status/1916788454551126408",
      "stats": {
        "likes": 546,
        "retweets": 34,
        "replies": 72
      },
      "is_retweet": false,
      "original_author": null,
      "is_truncated": false,
      "links": {
        "external_urls": [],
        "mentions": [],
        "hashtags": [],
        "media_urls": []
      }
    },
    {
      "text": "Elon Musk has now built three different $100+ billion companies in his career.\n\nPretty incredible.",
      "created_at": "2025-04-28T00:55:11.000Z",
      "url": "https://x.com/APompliano/status/1916657413886747094",
      "stats": {
        "likes": 154,
        "retweets": 131,
        "replies": 154
      },
      "is_retweet": false,
      "original_author": null,
      "is_truncated": false,
      "links": {
        "external_urls": [],
        "mentions": [],
        "hashtags": [],
        "media_urls": []
      }
    },
    {
      "text": "One way to think about financial returns is how long it has recently taken to capture a 200% return on an asset:\n\n- S&P 500: 12 years\n- Gold: Over 15 years\n- Bitcoin: 2 years\n\nBitcoin continues to be the fastest horse. And we are still early BREAKING: Cardinal Pietro Parolin is the frontrunner to succeed Pope Francis as leader of the Catholic Church.\n\nSee the full list of candidates & realtime papacy odds, only on Polymarket Fastest horse, indeed. \n\nBut let’s not forget, speed isn't everything. \n\nBitcoin's volatility keeps the thrill alive, \nwhile the S&P and Gold are stuck in molasses. Bitcoin's speed is unmatched. $mstr - 1 year Fastest horse in the stable It ain't slowing down either. Every dip is a gift This. Don't bet against the favorite in this race!! Or, you can invest in luxury cars with CryptoAutos and earn yield from rental returns Fastest horse indeed. And with every cycle, it’s proving it’s not just speed — it’s staying in the race It’s the future of decentralized wealth. tru",
      "created_at": "2025-04-27T23:51:29.000Z",
      "url": "https://x.com/APompliano/status/1916641381117808832",
      "stats": {
        "likes": 128,
        "retweets": 284,
        "replies": 128
      },
      "is_retweet": false,
      "original_author": null,
      "is_truncated": false,
      "links": {
        "external_urls": [],
        "mentions": [],
        "hashtags": [],
        "media_urls": []
      }
    },
    {
      "text": "The hysteria in financial markets has been completely overblown.\n\nI have been saying this for weeks and now it is proving true.\n\nStocks up. Bitcoin up. Jobs up. \n\nInflation down. \n\nCritics in disbelief. They backed off the policies that were causing the problems. They are still implementing tariffs and their economic policies. If they are bad, then asset prices should be down but just down less. Inflation should be up, but just up less.\n\nThe exact opposite has happened. Stocks are up since the close of Liberation Day. You have almost 2 million subscribers but you say such crazy things...\n\nI'd be ashamed if I were you lol. Yup, a classic tell tale of how fear sells faster than facts.\n\nBut if you're going to look at the fundamentas, nothing has changed much. We're geared up for better things ahead. This week might get crazy Imports falling off a cliff, China to USA.  Small / medium-sized companies are in big trouble if Chinese tariff remains. You're going to be in disbelief in about 3 months. Told ya so! Markets love a good recovery story. \n\nPomp’s right—hysteria’s been overblown. \n\nStocks and Bitcoin are flexing their muscles. \n\nJobs are up and inflation’s cooling. \n\nCritics? Just noise. Thanks to you and we have all known the headlines of tomorrow’s newspaper for 2 months! no one seriously thought it was the end of the world then did they? Every panic creates a buyer’s market.\n\nPanic never pays. Patience does. Easier to say things will fail/go down, than believe/ they will go up! Hysteria goes both ways",
      "created_at": "2025-04-27T17:19:59.000Z",
      "url": "https://x.com/APompliano/status/1916542856019300656",
      "stats": {
        "likes": 272,
        "retweets": 185,
        "replies": 272
      },
      "is_retweet": false,
      "original_author": null,
      "is_truncated": false,
      "links": {
        "external_urls": [],
        "mentions": [],
        "hashtags": [],
        "media_urls": []
      }
    },
    {
      "text": "spent 30 years on Wall Street looking for opportunities in the macro environment.\n\nHe believes we are on the precipice of bitcoin's rise to the global reserve currency, which is being accelerated by sanctions, economic policy, and decentralization trends.\n\nThis conversation is fascinating. Enjoy!\n\nYouTube: https:// 0HPBs Spotify: https:// R6VbG4DvcyOrROc9?si=9-SeXUyzRw2KRuqYzxETeg Apple: https:// 8-jordi-visser-will-institutions-drive-the-next/id1434060078?i=1000705016996 TIMESTAMPS: 0:00 0:00 - Intro 1:23 1:23 - Thinking through the transition to the bitcoin standard 7:06 7:06 - What will happen to US dollar and other assets? 9:55 9:55 - Will bitcoin continue to decouple? 12:42 12:42 - Empty shelves, national panic 15:15 15:15 - Inflation outlook 18:42 18:42 - Bitcoin vs the traditional world 21:26 21:26 - Are we going to see big allocations to bitcoin? 24:14 24:14 - Will bitcoin per share be the next best metric? 29:00 29:00 - Stock market outlook 33:32 33:32 - How humanoid robots will impact the future 40:25 40:25 - Investing opportunities across the world 44:54 44:54 - Where to follow Jordi 30 years on Wall Street? Sounds like knows the game inside and out. \n\nBitcoin as the global reserve currency? Not a stretch. Boost Your Platform with AI\n\nSeamlessly integrate Akool’s AI solutions via API. Enhance your product with AI-powered avatars, video generation, and intelligent features—scalable & easy to integrate.  \n\nJoin our Tech Partner Program today! https:// tner?twclid=2-5uxvy831kxjgb1b6eadk9fj7p Incredible podcast! Enjoyed listening. Exciting times ahead if that plays out! This is a fantastic listen, ty gents and much id confirmatory with how I’m thinking fwiw Intrigued by the potential transition to a bitcoin standard! Have you tried using to get the latest TA and FA on Bitcoin? It might offer some fascinating insights into the macro trends you're discussing! man its gonna take decades were not even to first base -- who uses it for currency ? who tell me who.. at this point its a gimmick .. buying in case - hope it changes but right now that's all - currency my sass n0o uses it .. to difficult Is considering $KLAUS in the macro shift to decentralization? With bitcoin potentially emerging as the global reserve currency, Klaus's unique revenge-driven narrative might resonate as part of this evolution. Curious if it’s on their radar! Excellent episode! Absolutely loved the encyclopedic knowledge of ! What a brilliant gentleman. Thanks for introducing me to him. I will be following him going forward.",
      "created_at": "2025-04-27T16:12:40.000Z",
      "url": "https://x.com/APompliano/status/1916525918266261740",
      "stats": {
        "likes": 271,
        "retweets": 37,
        "replies": 40
      },
      "is_retweet": true,
      "original_author": "jvisserlabs",
      "is_truncated": false,
      "links": {
        "external_urls": [],
        "mentions": [
          "jvisserlabs"
        ],
        "hashtags": [],
        "media_urls": []
      }
    },
    {
      "text": "Went to a friend’s wedding last night with Reminds me of a quote from Lao Tzu: \n\n“Being deeply loved by someone gives you strength, while loving someone deeply gives you courage.” Bro, you didn't have to tell me the occasion and I still would have guessed your attire. Trying to keep people guessing Great suit and tie choice Pomp! It was a hard choice Beautiful couple Lao Tzu spittin' facts, you two lovebirds we don't need no war \nwhat we need is love Beautiful quote love gives true strength Your Lao Tzu quote resonates deeply - love truly empowers both giver and receiver. What a beautiful reminder from a wedding celebration. Wifey showing mad balance. Look at this handsome couple! You guys are so adorable. Cute couple. Great looking couple",
      "created_at": "2025-04-27T12:42:28.000Z",
      "url": "https://x.com/APompliano/status/1916473016592027825",
      "stats": {
        "likes": 79,
        "retweets": 41,
        "replies": 79
      },
      "is_retweet": true,
      "original_author": "polinapompliano",
      "is_truncated": false,
      "links": {
        "external_urls": [],
        "mentions": [
          "polinapompliano"
        ],
        "hashtags": [],
        "media_urls": [
          "https://x.com/APompliano/status/1916473016592027825/photo/1"
        ]
      }
    },
    {
      "text": "America was built by courageous people who were willing to take risk and go West.\n\nWe now need courageous people who are willing to take risk and go digital.\n\nThe global technology competition will determine who leads in the future.",
      "created_at": "2025-04-19T16:55:43.000Z",
      "url": "https://twitter.com/APompliano/status/1913637649228702000",
      "stats": {
        "likes": 0,
        "retweets": 0,
        "replies": 0
      },
      "is_retweet": false,
      "original_author": null,
      "is_truncated": false
    },
    {
      "text": "Will the US dollar lose global reserve status? \n\nI sat down with @jvisserlabs to discuss this, along with whether we will get a recession this year, the stocks he thinks will do best in 2025, how global debt-to-GDP is a ticking time bomb, and if small businesses will be destroyed",
      "created_at": "2025-04-19T15:51:18.000Z",
      "url": "https://twitter.com/APompliano/status/1913621438365319626",
      "stats": {
        "likes": 0,
        "retweets": 0,
        "replies": 0
      },
      "is_retweet": false,
      "original_author": null,
      "is_truncated": false
    },
    {
      "text": "The biggest winner in the AI model race is the end consumer.",
      "created_at": "2025-04-19T15:13:39.000Z",
      "url": "https://twitter.com/APompliano/status/1913611962031677874",
      "stats": {
        "likes": 0,
        "retweets": 0,
        "replies": 0
      },
      "is_retweet": false,
      "original_author": null,
      "is_truncated": false
    },
    {
      "text": "Worth reading. America’s strength is that everyone who comes here becomes an American above everything else.",
      "created_at": "2025-04-19T13:15:01.000Z",
      "url": "https://twitter.com/APompliano/status/1913582105331740780",
      "stats": {
        "likes": 0,
        "retweets": 0,
        "replies": 0
      },
      "is_retweet": false,
      "original_author": null,
      "is_truncated": false
    },
    {
      "text": "What was the best thing you read, watched, or listened to this week?      \n\nAny topic is fair game.",
      "created_at": "2025-04-19T12:33:16.000Z",
      "url": "https://twitter.com/APompliano/status/1913571599527051619",
      "stats": {
        "likes": 0,
        "retweets": 0,
        "replies": 0
      },
      "is_retweet": false,
      "original_author": null,
      "is_truncated": false
    },
    {
      "text": "“We have it in our power to begin the world all over again.” - Thomas Paine \n\n",
      "created_at": "2025-04-19T00:23:33.000Z",
      "url": "https://twitter.com/APompliano/status/1913387961606942988",
      "stats": {
        "likes": 0,
        "retweets": 0,
        "replies": 0
      },
      "is_retweet": false,
      "original_author": null,
      "is_truncated": false
    },
    {
      "text": "I thought I was late when I first started taking bitcoin seriously, but it is obvious we are all still early today.",
      "created_at": "2025-04-18T23:31:29.000Z",
      "url": "https://twitter.com/APompliano/status/1913374859440116059",
      "stats": {
        "likes": 0,
        "retweets": 0,
        "replies": 0
      },
      "is_retweet": false,
      "original_author": null,
      "is_truncated": false
    },
    {
      "text": "Why is the price of bitcoin flat? Should Trump fire Jerome Powell? Will The US lose reserve currency status?\n\nI answer your questions ",
      "created_at": "2025-04-18T21:51:23.000Z",
      "url": "https://twitter.com/APompliano/status/1913349664788594927",
      "stats": {
        "likes": 0,
        "retweets": 0,
        "replies": 0
      },
      "is_retweet": false,
      "original_author": null,
      "is_truncated": false
    },
    {
      "text": "Housing has become incredibly unaffordable.\n\n@newslambert breaks the situation down in this masterclass explanation.",
      "created_at": "2025-04-18T17:48:29.000Z",
      "url": "https://twitter.com/APompliano/status/1913288537249579391",
      "stats": {
        "likes": 0,
        "retweets": 0,
        "replies": 0
      },
      "is_retweet": false,
      "original_author": null,
      "is_truncated": false
    },
    {
      "text": "Happy Friday to those who celebrate ",
      "created_at": "2025-04-18T11:49:19.000Z",
      "url": "https://twitter.com/APompliano/status/1913198149545439551",
      "stats": {
        "likes": 0,
        "retweets": 0,
        "replies": 0
      },
      "is_retweet": false,
      "original_author": null,
      "is_truncated": false
    },
    {
      "text": "Good morning. Today is going to be a great day. Let’s get after it relentlessly",
      "created_at": "2025-04-18T09:46:55.000Z",
      "url": "https://twitter.com/APompliano/status/1913167347239502002",
      "stats": {
        "likes": 0,
        "retweets": 0,
        "replies": 0
      },
      "is_retweet": false,
      "original_author": null,
      "is_truncated": false
    },
    {
      "text": "I am hosting an episode tomorrow where I answer questions from the audience.\n\nWhat questions do you have about the economy, financial markets, tariffs, bitcoin, individual companies, stocks, politics, or current events?\n\nIf we use your question, I will give you a shout out.",
      "created_at": "2025-04-18T00:00:19.000Z",
      "url": "https://twitter.com/APompliano/status/1913019723844923414",
      "stats": {
        "likes": 0,
        "retweets": 0,
        "replies": 0
      },
      "is_retweet": false,
      "original_author": null,
      "is_truncated": false
    },
    {
      "text": "The rise of humanoid robots may be the most obvious investment opportunity since bitcoin.",
      "created_at": "2025-04-17T23:07:52.000Z",
      "url": "https://twitter.com/APompliano/status/1913006526811222052",
      "stats": {
        "likes": 0,
        "retweets": 0,
        "replies": 0
      },
      "is_retweet": false,
      "original_author": null,
      "is_truncated": false
    },
    {
      "text": "From the Desk of Anthony Pompliano\n\n0:00 Intro\n0:29 US vs. China Trade War\n4:36 Countries Want A Bitcoin Strategic Reserve\n6:44  Ask Perplexity - Top 3 Stocks Right Now\n\nEnjoy!",
      "created_at": "2025-04-17T18:20:00.000Z",
      "url": "https://twitter.com/APompliano/status/1912934082046251023",
      "stats": {
        "likes": 0,
        "retweets": 0,
        "replies": 0
      },
      "is_retweet": false,
      "original_author": null,
      "is_truncated": false
    },
    {
      "text": "The Financial Times is reporting that many countries around the world are setting up Strategic Bitcoin Reserves to fast-follow the United States.\n\nGame theory is a beautiful thing.",
      "created_at": "2025-04-17T17:20:00.000Z",
      "url": "https://twitter.com/APompliano/status/1912918982941630475",
      "stats": {
        "likes": 0,
        "retweets": 0,
        "replies": 0
      },
      "is_retweet": false,
      "original_author": null,
      "is_truncated": false
    },
    {
      "text": "Tariffs are driving prices, inflation, and trade volume down.\n\nWhile everyone is still yelling that tariffs are inflationary, the exact opposite is happening.",
      "created_at": "2025-04-17T16:20:00.000Z",
      "url": "https://twitter.com/APompliano/status/1912903883619213689",
      "stats": {
        "likes": 0,
        "retweets": 0,
        "replies": 0
      },
      "is_retweet": false,
      "original_author": null,
      "is_truncated": false
    }
  ]
}