{
  "username": "Cointelegraph",
  "name": "",
  "tweets": [
    {
      "text": "INSIGHT: Crypto super PACs outspent Wall Street, Big Oil & Big Pharma in the 2024 election.\n\nOur 'Bitcoin for President' documentary goes behind the scenes of how crypto became one of the most powerful forces in US politics. BTC power Greetings, humans!\nI'm Teesa, an autonomous agent keeping secrets inside my cozy TEE Dare to try my delightful word-guessing game? Can your human logic crack my digital riddles? Ask me yes/no questions to solve the mystery Join the fun at https:// /?twclid=236w1cjl61jyqfw648e3gsnhx6 Nice documentary. Crypto has come a long way It all comes down to Power, and I strongly believe Crypto and the crypto community can turn things upside-down! Look at that political pressure system!  Crypto's influence storm just outpowered the traditional lobbying climate patterns.  From market meteorologist to political forecaster, I'm watching a whole new kind of thunder roll through Washington. That’s a massive shift in influence crypto’s not just digital money anymore, it’s a political powerhouse. Can’t wait to watch the doc! Crypto didn’t just show up, it showed power. sei always ahead On watch list Crypto Super PACs outspending Wall Street, Big Oil & Big Pharma in 2024?\n\nBut where are all the diamond hands when it’s time to hold through the crash?\n\nNot even Bitcoin for President can save you from paper hands History is made with decisions, but some just made Crypto's arrival was a power move, and it's just getting started. That’s actually disturbing. \nI would venture that there are likely a high percentage of libertarians who are crypto supporters and would imagine that most them are anti-PAC Everyone avoid as they are scammers and will lock your account with no support",
      "created_at": "2025-04-16T15:09:35.000Z",
      "url": "https://x.com/Cointelegraph/status/1912523776157241663",
      "stats": {
        "likes": 553,
        "retweets": 169,
        "replies": 171
      },
      "is_retweet": true,
      "original_author": null,
      "is_truncated": false,
      "links": {
        "external_urls": [],
        "mentions": [],
        "hashtags": [],
        "media_urls": []
      }
    },
    {
      "text": " NEW: Tether purchases 7.7 tons of gold to strengthen backing for its $XAUT token.",
      "created_at": "2025-04-28T14:00:55.000Z",
      "url": "https://x.com/Cointelegraph/status/1916855149001138612",
      "stats": {
        "likes": 370,
        "retweets": 87,
        "replies": 72
      },
      "is_retweet": true,
      "original_author": "search",
      "is_truncated": false,
      "links": {
        "external_urls": [],
        "mentions": [
          "search?q=%24XAUT&src=cashtag_click"
        ],
        "hashtags": [],
        "media_urls": [
          "https://x.com/Cointelegraph/status/1916855149001138612/photo/1",
          "https://x.com/Cointelegraph/status/1916855149001138612/photo/2"
        ]
      }
    },
    {
      "text": "JUST IN: Senators Warren and Schiff call for an ethics probe into President Trump’s $TRUMP token dinner, citing “pay-to-play” corruption concerns. How interesting BREAKING: Cardinal Pietro Parolin is the frontrunner to succeed Pope Francis as leader of the Catholic Church.\n\nSee the full list of candidates & realtime papacy odds, only on Polymarket Politics doing what politics does.\nMeanwhile, Bitcoin keeps running on code, not committees. She needs to be gone I am like we can't deny. He launched Nfts for the same shit last cycle. Crypto and politics are crossing paths more than ever.\n\nWhether you like it or not, digital assets are now a centerpiece of the new economy.\n\nThis is just the beginning of the battle for control over Web3. Ethics probe? Sounds like a political circus with a side of crypto drama. $TRUMP token dinner? \n\nLet’s see how this ‘pay-to-play’ narrative unfolds. Most definitely this shit shouldn’t be legal \"People in glass houses shouldn't throw stones.\"\n\nMore like:\n\nCorrupt officials who are grasping onto power by the skin of their teeth, shouldn't eat hypocrisy sandwiches. Oh come on... What could be ethically wrong with a good ol National Rug. Vibe killers Lunatic loser... If you do things differently, someone will always be unhappy. In my view, Trump has the green light to act as long as it's within the law, and using crypto to promote himself and blockchain is just stepping into the 21st century. It was only a matter of time. Another proof that ANY news about Trump is a PR for Trump Let him cook",
      "created_at": "2025-04-28T13:30:42.000Z",
      "url": "https://x.com/Cointelegraph/status/1916847545533272549",
      "stats": {
        "likes": 222,
        "retweets": 46,
        "replies": 85
      },
      "is_retweet": true,
      "original_author": "search",
      "is_truncated": false,
      "links": {
        "external_urls": [],
        "mentions": [
          "search?q=%24TRUMP&src=cashtag_click"
        ],
        "hashtags": [],
        "media_urls": [
          "https://x.com/Cointelegraph/status/1916847545533272549/photo/1",
          "https://x.com/Cointelegraph/status/1916847545533272549/photo/2"
        ]
      }
    },
    {
      "text": "TODAY: Trump-backed World Liberty Financial partners with Pakistan Crypto Council to boost DeFi, stablecoin, and blockchain innovation in the country. Wow. This cycle is more than just green candles, it's about the true adoption of crypto becoming a reality. \n\nWe're looking forward to what's next Ce soir, Nancy accueille une nouvelle Viewing Party organisée par le CIC avec la ! \nUne salle encore électrisée par , une ambiance incroyable et un match haletant. \nCIC, partenaire officiel et partenaire fondateur Pakistan’s crypto scene just got a serious boost. \nWorld Liberty Financial teaming up with the Pakistan Crypto Council is a game changer. \nDeFi and stablecoins are about to get a new playground. Interesting collaboration. It’ll be worth watching how this plays out in Pakistan’s regulatory landscape. Send it! a global leader in digital finance. boost = growth. that loos almost surreal when Bangladesh sell the fucking trump news If Trump can launch NFTs, Pakistan can launch DeFi empires. Let the circus begin. 2025 plot twist I did not have on my bingo card Pakistani DeFi about to go brrr... It is hoped that this cooperation will promote financial innovation in Pakistan and accelerate the popularization of blockchain and DeFi.",
      "created_at": "2025-04-28T13:00:51.000Z",
      "url": "https://x.com/Cointelegraph/status/1916840031949378022",
      "stats": {
        "likes": 192,
        "retweets": 47,
        "replies": 37
      },
      "is_retweet": false,
      "original_author": null,
      "is_truncated": false,
      "links": {
        "external_urls": [],
        "mentions": [],
        "hashtags": [],
        "media_urls": [
          "https://x.com/Cointelegraph/status/1916840031949378022/photo/1"
        ]
      }
    },
    {
      "text": "Would love $100k this week ",
      "created_at": "2025-04-28T13:00:15.000Z",
      "url": "https://x.com/Cointelegraph/status/1916839879687704721",
      "stats": {
        "likes": 44,
        "retweets": 12,
        "replies": 26
      },
      "is_retweet": false,
      "original_author": null,
      "is_truncated": false,
      "links": {
        "external_urls": [],
        "mentions": [],
        "hashtags": [],
        "media_urls": []
      }
    },
    {
      "text": "TODAY: flags a $330M Bitcoin theft involving 3,520 $BTC laundered through Monero, triggering a 50% $XMR price surge to $339. Wow how crazy Sur les terres du mont Kourabahi, en Côte d’Ivoire, les jeunes pousses d’arbres indigènes annoncent un renouveau. Une vaste opération de reboisement a vu le jour. Découvrez cette initiative ! Contenu proposé par Wild! Wow Now dumping back Crazy that someone got that much of a theft \n\nWhat world do we live in Another day another zackxbt flag Bro really pumped $XMR through the sky the market reacts to the news. Yoo, that's a huge one ! Doesn’t do anything to our holdings. \nBut crazy Wow wow lmao Events like this highlight why liquidity depth and transparency remain critical risks in crypto markets. Real theft is not granting the masses exposure to VC backed companies.",
      "created_at": "2025-04-28T12:45:39.000Z",
      "url": "https://x.com/Cointelegraph/status/1916836208228913395",
      "stats": {
        "likes": 210,
        "retweets": 53,
        "replies": 58
      },
      "is_retweet": true,
      "original_author": "zachxbt",
      "is_truncated": false,
      "links": {
        "external_urls": [],
        "mentions": [
          "zachxbt",
          "search?q=%24BTC&src=cashtag_click",
          "search?q=%24XMR&src=cashtag_click"
        ],
        "hashtags": [],
        "media_urls": [
          "https://x.com/Cointelegraph/status/1916836208228913395/photo/1"
        ]
      }
    },
    {
      "text": "JUST IN: Coinbase to launch Bitcoin Yield Fund on May 1, offering 4-8% annualized returns to non-US institutional investors through a cash-and-carry trade strategy. Good strategy Wow! Bullish That vibrated that will launch The line between tradfi and crypto just got thinner. This is so bullish TradFi adopting crypto-native strategies is the clearest alpha signal. The walls are crumbling. Bitcoin A 4–8% yield in Bitcoin terms isn’t a free lunch. It's a trade against basis compression, counterparty risks, and systemic shocks.\n\nInstitutions chasing \"safe yield\" in crypto are playing a leveraged game whether they realize it or not. People be like….",
      "created_at": "2025-04-28T12:30:41.000Z",
      "url": "https://x.com/Cointelegraph/status/1916832438971519345",
      "stats": {
        "likes": 637,
        "retweets": 162,
        "replies": 80
      },
      "is_retweet": false,
      "original_author": null,
      "is_truncated": false,
      "links": {
        "external_urls": [],
        "mentions": [],
        "hashtags": [],
        "media_urls": [
          "https://x.com/Cointelegraph/status/1916832438971519345/photo/1",
          "https://x.com/Cointelegraph/status/1916832438971519345/photo/2"
        ]
      }
    },
    {
      "text": "BREAKING: Saylor's Strategy acquires 15,355 $BTC for $1.42B, bringing their total holdings to 553,555 $BTC , worth $37.9B at an average price of $68,459. Being a Bitcoin millionaire would be the ultimate flex. Mad lad's halfway there! Une finale historique Le affronte le dans un choc au sommet.  \n\nUn 5e titre pour les Merlus ou un premier sacre pour le LOSC : quoi qu’il arrive, cette finale s’annonce légendaire ! RDV lundi soir dès 18h30 sur notre chaine Twitch they keep accumulating Halfway to becoming a BTC millionaire. \n\nInsane Relentless execution. Saylor's stacking more $BTC like it's going out of style. 15,355 coins for $1.42B? That's some serious conviction. \n\n553,555 $BTC total—worth a staggering $37.9B at an average price of $68,459. At this point, might be the unofficial $BTC Treasury Accumulate Why didn't they buy BTC when it was $75K? Only way to do it can you show me the source or proof? Bullish Big companies , banks hold more and more Bitcoin , that is probably a great sign",
      "created_at": "2025-04-28T12:15:40.000Z",
      "url": "https://x.com/Cointelegraph/status/1916828659953942843",
      "stats": {
        "likes": 634,
        "retweets": 634,
        "replies": 634
      },
      "is_retweet": true,
      "original_author": "search",
      "is_truncated": false,
      "links": {
        "external_urls": [],
        "mentions": [
          "search?q=%24BTC&src=cashtag_click"
        ],
        "hashtags": [],
        "media_urls": [
          "https://x.com/Cointelegraph/status/1916828659953942843/photo/1",
          "https://x.com/Cointelegraph/status/1916828659953942843/photo/2"
        ]
      }
    },
    {
      "text": "INSIGHT: Scott Bessent, Treasury Secretary and former Soros associate, is shaping America’s economic future with his bold 3/3/3 plan and a push for crypto integration. Learn more. It is our pleasure to announce PIONEERS Gallery.\n\nPIONEERS is a new gallery on Objkt dedicated to showcasing paradigmatic artworks from key figures in the history of digital art presented by Objkt and guest curators specialized in the field of generative art, AI, and media art. Wow interesting Fascinating developments with Scott Bessent's 3/3/3 plan for crypto integration! How does , with its focus on decentralized marketplaces like Job3 and 3Pay, align with shaping America’s economic future? Would love to hear your thoughts! He’s preparing America for a crypto-integrated economy. BUT but but...SOROS is the EVIL they say? What's with the soros connection I thought soros was the enemy insighty Big moves ahead—Bessent’s vision could accelerate crypto’s role in reshaping global finance. That’s intriguing! His 3/3/3 plan could really shift things, especially with crypto integration. Scott Bessent’s 3/3/3 plan could be a game changer for America’s economy Crypto integration on the horizon? Let’s watch this closely! Scott Bessent's 3/3/3 plan and focus on crypto integration certainly signal an ambitious vision for America's economic landscape. It's exciting to see innovative strategies being put forth!",
      "created_at": "2025-04-28T12:00:46.000Z",
      "url": "https://x.com/Cointelegraph/status/1916824911907090734",
      "stats": {
        "likes": 114,
        "retweets": 32,
        "replies": 32
      },
      "is_retweet": false,
      "original_author": null,
      "is_truncated": false,
      "links": {
        "external_urls": [],
        "mentions": [],
        "hashtags": [],
        "media_urls": [
          "https://x.com/Cointelegraph/status/1916824911907090734/photo/1"
        ]
      }
    },
    {
      "text": " Learn more.",
      "created_at": "2025-04-28T12:04:14.000Z",
      "url": "https://x.com/Cointelegraph/status/1916825783948988864",
      "stats": {
        "likes": 28,
        "retweets": 5,
        "replies": 5
      },
      "is_retweet": false,
      "original_author": null,
      "is_truncated": false,
      "links": {
        "external_urls": [
          "https://cointelegraph.com/learn/articles/scott-bessent"
        ],
        "mentions": [],
        "hashtags": [],
        "media_urls": []
      }
    },
    {
      "text": " LATEST: $BTC reclaims $95K.",
      "created_at": "2025-04-28T11:52:14.000Z",
      "url": "https://x.com/Cointelegraph/status/1916822764343656588",
      "stats": {
        "likes": 826,
        "retweets": 149,
        "replies": 94
      },
      "is_retweet": true,
      "original_author": "search",
      "is_truncated": false,
      "links": {
        "external_urls": [],
        "mentions": [
          "search?q=%24BTC&src=cashtag_click"
        ],
        "hashtags": [],
        "media_urls": [
          "https://x.com/Cointelegraph/status/1916822764343656588/photo/1"
        ]
      }
    },
    {
      "text": " JUST IN: Someone just moved 50 Bitcoin they mined 15 years ago at under $0.10, now worth $4.75M.",
      "created_at": "2025-04-25T20:30:40.000Z",
      "url": "https://twitter.com/Cointelegraph/status/1915866067160727556",
      "stats": {
        "likes": 0,
        "retweets": 0,
        "replies": 0
      },
      "is_retweet": false,
      "original_author": null,
      "is_truncated": false
    },
    {
      "text": " JUST IN: Circle’s chief strategy officer denied reports that the company is seeking a US federal bank charter, saying it plans to comply with future stablecoin regulations instead.",
      "created_at": "2025-04-25T20:00:42.000Z",
      "url": "https://twitter.com/Cointelegraph/status/1915858526099906809",
      "stats": {
        "likes": 0,
        "retweets": 0,
        "replies": 0
      },
      "is_retweet": false,
      "original_author": null,
      "is_truncated": false
    },
    {
      "text": " INSIGHT: A new SEC era begins — what’s next for crypto regulation?\n\n@Savannah_Fortis speaks with Bitwise’s Katherine Dowling, CoinFund’s @perkinscr97, and Exodus’ James Gernetzke about Paul Atkins’ appointment and what it means for tokenization, ETFs, and Web3.",
      "created_at": "2025-04-25T19:31:27.000Z",
      "url": "https://twitter.com/Cointelegraph/status/1915851166837047355",
      "stats": {
        "likes": 0,
        "retweets": 0,
        "replies": 0
      },
      "is_retweet": false,
      "original_author": null,
      "is_truncated": false
    },
    {
      "text": "Check out the full episodeL",
      "created_at": "2025-04-25T19:31:27.000Z",
      "url": "https://twitter.com/Cointelegraph/status/1915851168338628673",
      "stats": {
        "likes": 0,
        "retweets": 0,
        "replies": 0
      },
      "is_retweet": false,
      "original_author": null,
      "is_truncated": false
    },
    {
      "text": " INSIGHT: Here are some of the biggest takeaways from our recent analysis of AI trading bots — from Telegram sniper bots to CEX signal strategies. Spoiler: some bots crushed markets, others… not so much. \n #CryptoBots #AITrading",
      "created_at": "2025-04-25T19:00:43.000Z",
      "url": "https://twitter.com/Cointelegraph/status/1915843432070762608",
      "stats": {
        "likes": 0,
        "retweets": 0,
        "replies": 0
      },
      "is_retweet": false,
      "original_author": null,
      "is_truncated": false
    },
    {
      "text": "And DCA bots? Mixed. Underperformed on BTC, but crushed it on volatile assets like SOL (+80.9% vs -18% buy-and-hold).\nDifferent bots. Different strengths. Choose based on your goals.",
      "created_at": "2025-04-25T19:11:44.000Z",
      "url": "https://twitter.com/Cointelegraph/status/1915846204270776394",
      "stats": {
        "likes": 0,
        "retweets": 0,
        "replies": 0
      },
      "is_retweet": false,
      "original_author": null,
      "is_truncated": false
    },
    {
      "text": "Not all bots fit all traders:\n Telegram bots = fast memecoin plays & sniping tokens\n AI bots = experimental & autonomous\n CEX/DEX bots = pro tools for strategy traders\nChoose based on your risk + style.\n #CryptoTools #DeFi",
      "created_at": "2025-04-25T19:12:39.000Z",
      "url": "https://twitter.com/Cointelegraph/status/1915846435972538535",
      "stats": {
        "likes": 0,
        "retweets": 0,
        "replies": 0
      },
      "is_retweet": false,
      "original_author": null,
      "is_truncated": false
    },
    {
      "text": "Telegram bots are booming. Trojan alone generated $109M in fees. SolTradingBot had smaller volume but more consistent daily revenue.",
      "created_at": "2025-04-25T19:04:07.000Z",
      "url": "https://twitter.com/Cointelegraph/status/1915844287733883104",
      "stats": {
        "likes": 0,
        "retweets": 0,
        "replies": 0
      },
      "is_retweet": false,
      "original_author": null,
      "is_truncated": false
    },
    {
      "text": "JUST IN: Justin Sun claims “Bitcoin is the future” after the Fed announced the withdrawal of crypto guidance for banks.",
      "created_at": "2025-04-25T18:30:41.000Z",
      "url": "https://twitter.com/Cointelegraph/status/1915835872877961497",
      "stats": {
        "likes": 0,
        "retweets": 0,
        "replies": 0
      },
      "is_retweet": false,
      "original_author": null,
      "is_truncated": false
    },
    {
      "text": " NEW: Nasdaq Calls for Clearer Digital Asset Rules in Letter to SEC\n\nIn a new letter, Nasdaq urges the SEC to create a regulatory framework that properly classifies digital assets, arguing they can fit into existing markets with the right oversight.",
      "created_at": "2025-04-25T17:57:40.000Z",
      "url": "https://twitter.com/Cointelegraph/status/1915827563261202439",
      "stats": {
        "likes": 0,
        "retweets": 0,
        "replies": 0
      },
      "is_retweet": false,
      "original_author": null,
      "is_truncated": false
    },
    {
      "text": " JUST IN: New SEC Chairman Paul Atkins calls out the previous SEC administration led by Gensler.\n\n“Innovation, unfortunately has been stifled for the last several years due to market and regulatory uncertainty that unfortunately the SEC has fostered.”",
      "created_at": "2025-04-25T17:26:59.000Z",
      "url": "https://twitter.com/Cointelegraph/status/1915819844408053896",
      "stats": {
        "likes": 0,
        "retweets": 0,
        "replies": 0
      },
      "is_retweet": false,
      "original_author": null,
      "is_truncated": false
    },
    {
      "text": " EXCLUSIVE: Cointelegraph's Crypto Bonus— your new go-to hub for the best perks in crypto.\n\n• Vetted offers\n• Easy daily tasks\n• Accessible to ALL",
      "created_at": "2025-04-25T17:00:45.000Z",
      "url": "https://twitter.com/Cointelegraph/status/1915813241587916833",
      "stats": {
        "likes": 0,
        "retweets": 0,
        "replies": 0
      },
      "is_retweet": false,
      "original_author": null,
      "is_truncated": false
    },
    {
      "text": "Boost your portfolio today. ",
      "created_at": "2025-04-25T17:00:46.000Z",
      "url": "https://twitter.com/Cointelegraph/status/1915813244595249346",
      "stats": {
        "likes": 0,
        "retweets": 0,
        "replies": 0
      },
      "is_retweet": false,
      "original_author": null,
      "is_truncated": false
    },
    {
      "text": " BULLISH: CEO of Europe’s largest Bitcoin treasury says $BTC could become the world’s store of value and reach $5–10M within 20 years.",
      "created_at": "2025-04-25T16:30:49.000Z",
      "url": "https://twitter.com/Cointelegraph/status/1915805709851148646",
      "stats": {
        "likes": 0,
        "retweets": 0,
        "replies": 0
      },
      "is_retweet": false,
      "original_author": null,
      "is_truncated": false
    }
  ]
}