{
  "username": "scottmelker",
  "name": "",
  "tweets": [
    {
      "text": "DANA WHITE, UFC, CRYPTO!\n\nNot promises. Not hype. Real impact. \n@vechainofficial\n and \n@sunshinelu24\n are teaming up with \n@danawhite\n @ufc\n @BCG\n @4ocean\n to incentivize people to save the planet with crypto – and they’re just getting started.\n\nFull video below. Big things ahead. ",
      "created_at": "2025-04-26T13:00:00.000Z",
      "url": "https://x.com/scottmelker/status/1916115044024168903",
      "is_truncated": false,
      "links": {
        "external_urls": [],
        "mentions": [
          "vechainofficial",
          "sunshinelu24",
          "danawhite",
          "ufc",
          "BCG",
          "4ocean"
        ],
        "hashtags": [],
        "media_urls": []
      }
    },
    {
      "text": "Crypto needs this.\n\nI sat down with \n@sunshinelu24\n, CEO of \n@vechainofficial\n, to dive into how crypto and real-world sustainability are finally coming together.\n\nWATCH: https://youtu.be/LI0T8M6sMTU",
      "created_at": "2025-04-28T04:00:00.000Z",
      "url": "https://x.com/scottmelker/status/1916703924062466361",
      "is_truncated": false,
      "links": {
        "external_urls": [
          "https://t.co/GzlM1IkN8Y"
        ],
        "mentions": [
          "sunshinelu24",
          "vechainofficial"
        ],
        "hashtags": [],
        "media_urls": []
      }
    },
    {
      "text": "Look at all of these charts and explain to me how tariffs are a good idea.",
      "created_at": "2025-04-28T00:06:14.000Z",
      "url": "https://x.com/scottmelker/status/1916645094603497892",
      "is_truncated": false,
      "links": {
        "external_urls": [],
        "mentions": [],
        "hashtags": [],
        "media_urls": [
          "https://x.com/BoringBiz_/status/1916633322962244090/photo/1"
        ]
      }
    },
    {
      "text": "We don't have an excuse anymore. \n\nWith \n@sunshinelu24\n, the CEO of \n@vechainofficial\n \n\nFULL VIDEO: \nhttps://youtu.be/LI0T8M6sMTU",
      "created_at": "2025-04-27T23:01:03.000Z",
      "url": "https://x.com/scottmelker/status/1916628687581069570",
      "is_truncated": false,
      "links": {
        "external_urls": [
          "https://t.co/GzlM1IkN8Y"
        ],
        "mentions": [
          "sunshinelu24",
          "vechainofficial"
        ],
        "hashtags": [],
        "media_urls": []
      }
    },
    {
      "text": "Floods in Dubai this year or nah?",
      "created_at": "2025-04-27T21:57:59.000Z",
      "url": "https://x.com/scottmelker/status/1916612820130566154",
      "is_truncated": false,
      "links": {
        "external_urls": [],
        "mentions": [],
        "hashtags": [],
        "media_urls": []
      }
    },
    {
      "text": "1/ I'VE BEEN THINKING about why the Fed left in place one of its anti-#crypto statements while rescinding all 4 others. The one it left in place was issued in coordination w/ the Biden White House's anti-crypto statement on January 27, 2023. Link here:\nhttps://federalregister.gov/documents/2023/02/07/2023-02192/policy-statement-on-section-913-of-the-federal-reserve-act… “Jerome Powell defies Trump, keeps crypto restrictions at Fed”  headline\nhttps://protos.com/jerome-powell-defies-trump-keeps-crypto-restrictions-at-fed/… 2/ The Jan 27, 2023 guidance left in place by the Fed does many things, but here are the keys:\na. blocks banks from touching cryptoassets as principal, even in a tiny amount to pay gas/transaction fees,\nb. blocks banks from issuing #stablecoins on permissionless blockchains + 3/ c. maintains a Fed policy preferring permissioned blockchains over permissionless ones--even tho the other federal banking agencies (OCC/FDIC) rescinded that.\n\nWhat means? \n\n**THE FED HAS MAINTAINED A REGULATORY PREFERENCE FOR PERMISSIONED STABLECOINS (ie, big-bank versions)** 4/ When the #stablecoin bill becomes law the Fed's preference for permissioned blockchains will be overturned. So Congress should hurry up! bc in the meantime, the Fed just gave the big banks' private stablecoins a head start before the stablecoin market really opens up. 5/ Next, let's turn to the Fed keeping its old policy that banks can't touch #crypto directly (as principal). This blocks banks from making markets in BTC, ETH, SOL, etc (something the WallSt banks want to do), but it also does something more insidious to banks in crypto custody: 6/ Crypto custodians usually charge customers for gas/transaction fees for on-chain transactions, but by definition they must estimate those fees before transacting--& their estimates might be too low if on-chain fees moved up in the meantime, for ex.--so the trade would fail. 7/ Custodians often break up large balances into small ones for risk management purposes. Who pays the gas/transaction fees for such on-chain transactions, driven by prudent risk management? A bank as custodian cannot. This will discourage banks from entering the custody business 8/ Summing it up, the Fed has kept sand in the wheels of banks becoming custodians of BTC, ETH, etc, while also creating a structural advantage for the big banks' permissioned stablecoins to launch *now* (while everyone else waits for the stablecoin bill to take effect). 9/ The Fed definitely won on PR spin--its press release listed a long list of guidance it rescindedbut omitted ANY mention of the guidance it kept. That duped *a lot* of smart people, understandably. Y'all *SHOULD* be angry now that you know the truth. 10/ Even the \n@WhiteHouse\n praised the Fed, seeming not to know what actually happened (see \n@DavidSacks\n @davidsacks47\n tweet yesterday). That fact raises all kinds of questions about what the White House was expecting, what the Fed had promised it'd do & Fed/White House relations. 11/ Don't forget, a confrontation is brewing btwn the Fed & White House not just over interest rates (which media have well-documented) but also over bank regulation (which almost no one is discussing).  This \n@bank_reg\n thread discusses the brewing conflict OMB memo tells independent agencies to begin complying with Executive Order 14215  https://whitehouse.gov/wp-content/uploads/2025/02/M-25-24-Interim-Guidance-Implementing-Section-3-of-Executive-Order-14215-Titled-Ensuring-Accountability-for-All-Agencies.pdf…",
      "created_at": "2025-04-27T19:10:41.000Z",
      "url": "https://x.com/CaitlinLong_/status/1916570716880933266",
      "is_truncated": true,
      "links": {
        "external_urls": [
          "https://t.co/VntoUEBn9L"
        ],
        "mentions": [
          "CaitlinLong_"
        ],
        "hashtags": [
          "crypto"
        ],
        "media_urls": []
      }
    },
    {
      "text": "PRESIDENT TRUMP: \"WHEN TARIFFS CUT IN, MANY PEOPLE'S INCOME TAXES WILL BE SUBSTANTIALLY REDUCED, MAYBE EVEN COMPLETELY ELIMINATED.\"",
      "created_at": "2025-04-27T20:00:00.000Z",
      "url": "https://x.com/scottmelker/status/1916583127151264120",
      "is_truncated": false,
      "links": {
        "external_urls": [],
        "mentions": [],
        "hashtags": [],
        "media_urls": []
      }
    },
    {
      "text": "Why THIS Crypto Is About To Skyrocket With \n@danawhite\n On Board \n\nFull below video with \n@vechainofficial\n CEO, \n@sunshinelu24",
      "created_at": "2025-04-27T18:00:00.000Z",
      "url": "https://x.com/scottmelker/status/1916552929924018388",
      "is_truncated": false,
      "links": {
        "external_urls": [],
        "mentions": [
          "danawhite",
          "vechainofficial",
          "sunshinelu24"
        ],
        "hashtags": [],
        "media_urls": []
      }
    },
    {
      "text": "I am willing to store Saylor’s Bitcoin if both of us believe that is useful.",
      "created_at": "2025-04-27T15:49:15.000Z",
      "url": "https://x.com/scottmelker/status/1916520024769954286",
      "is_truncated": false,
      "links": {
        "external_urls": [],
        "mentions": [],
        "hashtags": [],
        "media_urls": []
      }
    },
    {
      "text": "SEC APPROVES APRIL 30 PUBLIC LAUNCH OF PROSHARES TRUST'S $XRP ETF",
      "created_at": "2025-04-27T15:17:25.000Z",
      "url": "https://x.com/scottmelker/status/1916512013125116166",
      "is_truncated": false,
      "links": {
        "external_urls": [],
        "mentions": [
          "search?q=%24XRP&src=cashtag_click"
        ],
        "hashtags": [],
        "media_urls": []
      }
    },
    {
      "text": "There are REAL projects building REAL applications for mainstream users.\n@sunshinelu24\n and I had a long talk at \n@UFC\n Miami about the state of crypto and what needs to change to bring it to a billion people. Let's look for a real project BREAKING: Cardinal Pietro Parolin is the frontrunner to succeed Pope Francis as leader of the Catholic Church.\n\nSee the full list of candidates & realtime papacy odds, only on Polymarket Clear signal: crypto’s user base is climbing but still far from mass adoption, with less than 5% of the world onboard.  \n\nReal growth came as both institutional players and some governments ramped up, but regulatory fog and complex UX still gatekeep the next wave.  \n\nScalability, Bookmarked for later. a billion you say? sounds like a memecoin market cap waiting to happen Ribbit, Accessibility wins. Ribbit. $Purpe The real ones are here to stay. The farmers are gone. \"Real projects, real applications, mainstream users - the future of crypto is in accessibility and usability.\" Interesting talk on the potential of crypto for mainstream users! Have you checked out \n@MayoSolana\n? It's a new platform on Solana focused on real community benefits with innovative mechanisms for developers. Could be a game-changer for a billion users! 2017 called it wants its shitcoins back. Will there be a day when token holders are paid their share of earnings based on the blockchains net earnings? Onboarding the masses is the crypto holy grail, no doubt. It's exciting to see projects focusing on mainstream adoption in crypto. What specific changes do you think are crucial for reaching a billion users?",
      "created_at": "2025-04-27T14:56:33.000Z",
      "url": "https://x.com/scottmelker/status/1916506763081248961",
      "is_truncated": true,
      "links": {
        "external_urls": [
          "https://t.co/4ZVeBep85a"
        ],
        "mentions": [
          "sunshinelu24",
          "ufc",
          "UFC"
        ],
        "hashtags": [],
        "media_urls": []
      }
    }
  ]
}